tap "bazelbuild/tap"
tap "blendle/blendle", "https://github.com/blendle/homebrew-blendle.git"
tap "buo/cask-upgrade"
tap "hashicorp/tap"
tap "keith/formulae"
tap "mutagen-io/mutagen"
tap "oven-sh/bun"
tap "rs/tap"
tap "stelligent/tap"
tap "supabase/tap"
tap "telepresenceio/telepresence"
brew "act"
brew "adns"
brew "brotli"
brew "libpng"
brew "xz"
brew "libtiff"
brew "little-cms2"
brew "openexr"
brew "autoconf"
brew "automake"
brew "aws-iam-authenticator"
brew "aws-keychain"
brew "aws-shell"
brew "awscli"
brew "awscurl"
brew "libunistring"
brew "gettext"
brew "bash"
brew "bash-completion"
brew "freetype"
brew "pcre2"
brew "glib"
brew "bazel"
brew "cloc"
brew "cmake"
brew "cocoapods"
brew "gmp"
brew "coreutils"
brew "deno"
brew "docbook"
brew "docbook-xsl"
brew "docker", link: false
brew "x265"
brew "ffmpeg"
brew "fonttools"
brew "fzf"
brew "gdbm"
brew "gh"
brew "openjpeg"
brew "webp"
brew "ghostscript"
brew "git-lfs"
brew "gnu-getopt"
brew "libevent"
brew "libidn2"
brew "libtasn1"
brew "nettle"
brew "p11-kit"
brew "unbound"
brew "gnutls"
brew "libgpg-error"
brew "libassuan"
brew "libgcrypt"
brew "libksba"
brew "libusb"
brew "npth"
brew "pinentry"
brew "gnupg"
brew "go"
brew "golangci-lint"
brew "haproxy"
brew "pkgconf"
brew "helm"
brew "htop"
brew "hub"
brew "libde265"
brew "shared-mime-info"
brew "libheif"
brew "libtool"
brew "imagemagick"
brew "jmeter"
brew "jpeg"
brew "oniguruma"
brew "jq"
brew "k9s"
brew "keychain"
brew "kubernetes-cli", link: false
brew "kubectx"
brew "kustomize"
brew "libffi"
brew "libmagic"
brew "libpq"
brew "mas"
brew "openjdk"
brew "maven"
brew "mist-cli"
brew "mtr"
brew "mysql"
brew "neonctl"
brew "nginx"
brew "ninja"
brew "nmap"
brew "nvm"
brew "nx"
brew "ollama"
brew "opencode"
brew "openssl@1.1"
brew "pandoc"
brew "pbzip2"
brew "pcre"
brew "perl"
brew "pnpm", link: false
brew "poppler"
brew "progress"
brew "promptfoo"
brew "pyenv"
brew "python@3.10"
brew "python@3.11"
brew "python@3.9"
brew "rbenv"
brew "redis"
brew "rename"
brew "shellcheck"
brew "shmux"
brew "speedtest-cli"
brew "sshpass"
brew "sslscan"
brew "staticcheck"
brew "telnet"
brew "tfenv"
brew "tig"
brew "utf8proc"
brew "tmux"
brew "tree"
brew "unar"
brew "uv"
brew "vegeta"
brew "virtualenv"
brew "watch"
brew "wget"
brew "xmlto"
brew "yarn"
brew "ykman"
brew "ykpers"
brew "yt-dlp"
brew "zoxide"
brew "blendle/blendle/kns"
brew "keith/formulae/dyld-shared-cache-extractor"
brew "oven-sh/bun/bun"
brew "rs/tap/jaggr"
brew "rs/tap/jplot"
brew "supabase/tap/supabase"
brew "telepresenceio/telepresence/telepresence-oss"
cask "basictex"
cask "ccmenu"
cask "claude-code"
cask "codex"
cask "gcloud-cli"
cask "julia-app"
cask "karabiner-elements"
cask "ngrok"
cask "slack"
cask "spotify"
cask "vagrant"
cask "visual-studio-code"
cask "vnc-viewer"
mas "Bible Study", id: 472790630
mas "Final Cut Pro", id: 424389933
mas "Kindle", id: 302584613
mas "Logic Pro", id: 634148309
mas "Magnet", id: 441258766
mas "MeetingBar", id: 1532419400
mas "Perplexity", id: 6714467650
mas "SimpleMind", id: 439654198
mas "Take a Break", id: 1457158844
mas "WhatsApp", id: 310633997
vscode "aaravb.chrome-extension-developer-tools"
vscode "adpyke.vscode-sql-formatter"
vscode "andyyaldoo.vscode-json"
vscode "anthropic.claude-code"
vscode "bradlc.vscode-tailwindcss"
vscode "christian-kohler.npm-intellisense"
vscode "dbaeumer.vscode-eslint"
vscode "dsznajder.es7-react-js-snippets"
vscode "esbenp.prettier-vscode"
vscode "figma.figma-vscode-extension"
vscode "firsttris.vscode-jest-runner"
vscode "foxundermoon.shell-format"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "golang.go"
vscode "grapecity.gc-excelviewer"
vscode "hashicorp.terraform"
vscode "irongeek.vscode-env"
vscode "luxcium.pop-n-lock-theme-vscode"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-playwright.playwright"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode-remote.remote-containers"
vscode "nrwl.angular-console"
vscode "openai.chatgpt"
vscode "pkief.material-icon-theme"
vscode "pomdtr.excalidraw-editor"
vscode "prisma.prisma"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "shopify.ruby-lsp"
vscode "sourcegraph.amp"
vscode "stephanvs.dot"
vscode "streetsidesoftware.code-spell-checker"
vscode "supabase.postgrestools"
vscode "timonwong.shellcheck"
vscode "tomoki1207.pdf"
vscode "waderyan.gitblame"
vscode "xabikos.javascriptsnippets"
vscode "yhpnoraa.beauty"
vscode "yzhang.markdown-all-in-one"
go "github.com/golangci/golangci-lint/cmd/golangci-lint"
go "golang.org/x/tools/gopls"
