tap "oven-sh/bun"
tap "trystankaes/tools"
brew "adns"
brew "autoconf"
brew "automake"
brew "libunistring"
brew "gettext"
brew "bash"
brew "bash-completion"
brew "brotli"
brew "cloc"
brew "cmake"
brew "gmp"
brew "coreutils"
brew "xz"
brew "libtiff"
brew "little-cms2"
brew "deno"
brew "openssl@3"
brew "oniguruma"
brew "diffnav"
brew "docbook"
brew "docbook-xsl"
brew "docker"
brew "x265"
brew "ffmpeg"
brew "fonttools"
brew "libpng"
brew "freetype"
brew "fzf"
brew "gdbm"
brew "node"
brew "gemini-cli"
brew "gh"
brew "git-lfs"
brew "pcre2"
brew "glib"
brew "gnu-getopt"
brew "libevent"
brew "libidn2"
brew "libtasn1"
brew "nettle"
brew "p11-kit"
brew "unbound"
brew "gnutls"
brew "libgpg-error"
brew "libassuan"
brew "libgcrypt"
brew "libksba"
brew "libusb"
brew "npth"
brew "pinentry"
brew "gnupg"
brew "go"
brew "golangci-lint"
brew "libde265"
brew "openexr"
brew "shared-mime-info"
brew "webp"
brew "libheif"
brew "libtool"
brew "imagemagick"
brew "jpeg"
brew "jq"
brew "keychain"
brew "kubectx"
brew "kubernetes-cli"
brew "libffi"
brew "libmagic"
brew "libpq"
brew "llama.cpp"
brew "mas"
brew "mtr"
brew "mysql"
brew "tree-sitter"
brew "utf8proc"
brew "neovim"
brew "nginx"
brew "nvm"
brew "ollama"
brew "opencode"
brew "openjpeg"
brew "pacvim"
brew "pbzip2"
brew "pcre"
brew "perl"
brew "pkgconf"
brew "pnpm"
brew "postgresql@18", link: true
brew "promptfoo"
brew "redis"
brew "rtk"
brew "shmux"
brew "sshpass"
brew "staticcheck"
brew "tree"
brew "tree-sitter-cli"
brew "unar"
brew "uv"
brew "vegeta"
brew "watch"
brew "wget"
brew "xcodegen"
brew "xmlto"
brew "yt-dlp"
brew "zoxide"
brew "oven-sh/bun/bun"
brew "trystankaes/tools/worktree-switcher"
cask "alfred"
cask "bartender"
cask "basictex"
cask "codex"
cask "cursor"
cask "docker-desktop"
cask "gcloud-cli"
cask "ghostty"
cask "karabiner-elements"
cask "ngrok"
cask "opencode-desktop"
cask "slack"
cask "visual-studio-code"
mas "Bible Study", id: 472790630
mas "Final Cut Pro", id: 424389933
mas "Logic Pro", id: 634148309
mas "Magnet", id: 441258766
mas "MeetingBar", id: 1532419400
mas "Take a Break", id: 1457158844
mas "WhatsApp", id: 310633997
mas "Xcode", id: 497799835
vscode "aaravb.chrome-extension-developer-tools"
vscode "adpyke.vscode-sql-formatter"
vscode "andyyaldoo.vscode-json"
vscode "anthropic.claude-code"
vscode "anthropic.url-content-opener"
vscode "bradlc.vscode-tailwindcss"
vscode "catppuccin.catppuccin-vsc-icons"
vscode "christian-kohler.npm-intellisense"
vscode "databricks.neon-local-connect"
vscode "dbaeumer.vscode-eslint"
vscode "esbenp.prettier-vscode"
vscode "figma.figma-vscode-extension"
vscode "ggml-org.llama-vscode"
vscode "github.vscode-github-actions"
vscode "golang.go"
vscode "google.geminicodeassist"
vscode "googlecloudtools.cloudcode"
vscode "hashicorp.terraform"
vscode "irongeek.vscode-env"
vscode "johnny-zhao.oai-compatible-copilot"
vscode "luxcium.pop-n-lock-theme-vscode"
vscode "miguelsolorio.fluent-icons"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.makefile-tools"
vscode "openai.chatgpt"
vscode "pomdtr.excalidraw-editor"
vscode "redhat.vscode-yaml"
vscode "stephanvs.dot"
vscode "tomoki1207.pdf"
vscode "waderyan.gitblame"
vscode "yzhang.markdown-all-in-one"
go "github.com/golangci/golangci-lint/cmd/golangci-lint"
go "golang.org/x/tools/gopls"
