tap "bazelbuild/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "rs/tap"
brew "adns"
brew "gh"
brew "ghostscript"
brew "lolcat"
brew "jmeter"
brew "libmagic"
brew "npth"
brew "pyenv"
brew "utf8proc"
brew "jpeg"
brew "libomp"
brew "oniguruma"
brew "python"
brew "vegeta"
brew "autoconf"
brew "glib"
brew "jplot"
brew "libpng"
brew "openexr"
brew "python@3.8"
brew "watch"
brew "automake"
brew "gmp"
brew "jq"
brew "libtasn1"
brew "openjdk"
brew "readline"
brew "webp"
brew "bash-completion"
brew "gnu-getopt"
brew "libassuan"
brew "libtiff"
brew "openjpeg"
brew "redis", restart_service: true
brew "wget"
brew "bazel"
brew "gnupg"
brew "libde265"
brew "libtool"
brew "openssl@1.1"
brew "rename"
brew "x265"
brew "cmake"
brew "gnutls"
brew "libevent"
brew "libunistring"
brew "p11-kit"
brew "shared-mime-info"
brew "xmlto"
brew "coreutils"
brew "go"
brew "libffi"
brew "libusb"
brew "pbzip2"
brew "shmux"
brew "xz"
brew "docbook"
brew "haproxy"
brew "libgcrypt"
brew "little-cms2"
brew "pcre"
brew "sqlite"
brew "zlib"
brew "docbook-xsl"
brew "htop"
brew "libgpg-error"
brew "maven"
brew "pcre2"
brew "sslscan"
brew "freetype"
brew "ilmbase"
brew "libheif"
brew "ncurses"
brew "pinentry"
brew "telnet"
brew "gdbm"
brew "imagemagick"
brew "libidn2"
brew "nettle"
brew "pkg-config"
brew "tmux"
brew "gettext"
brew "jaggr"
brew "libksba"
brew "ninja"
brew "progress"
brew "unbound"
cask "docker"
cask "ngrok"
# cask "atom"
# cask "vscode"
# cask "java"
# cask "slack" || true
